{"config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 90, 320, 3], "input_dtype": "float32", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa%/home/gungor/Desktop/Driving/Model.py\u00da\b<lambda>U\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape": [90, 320, 3], "output_shape_type": "raw", "function_type": "lambda", "arguments": {}, "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "batch_input_shape": [null, 90, 320, 3], "activity_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "dim_ordering": "tf", "nb_filter": 16, "b_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "nb_col": 3, "W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 3, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [4, 4], "strides": [4, 4], "name": "maxpooling2d_1"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "name": "batchnormalization_1", "mode": 0}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "border_mode": "same", "dim_ordering": "tf", "nb_filter": 16, "b_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "nb_col": 3, "W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 3, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "name": "batchnormalization_2", "mode": 0}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "border_mode": "same", "dim_ordering": "tf", "nb_filter": 16, "b_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "nb_col": 5, "W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 5, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "name": "batchnormalization_3", "mode": 0}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_4"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "border_mode": "same", "dim_ordering": "tf", "nb_filter": 16, "b_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "nb_col": 5, "W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 5, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "name": "batchnormalization_4", "mode": 0}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_5"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "name": "batchnormalization_5", "mode": 0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "border_mode": "same", "dim_ordering": "tf", "nb_filter": 32, "b_regularizer": null, "name": "convolution2d_5", "init": "glorot_uniform", "nb_col": 3, "W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 3, "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "bias": true, "b_constraint": null, "output_dim": 512, "input_dim": 160}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "bias": true, "b_constraint": null, "output_dim": 128, "input_dim": 512}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "W_constraint": null, "bias": true, "b_constraint": null, "output_dim": 1, "input_dim": 128}}], "keras_version": "1.2.0", "class_name": "Sequential"}